<template>

    <div style="font-family: 'Comfortaa', sans-serif;
    font-size: 23px;margin-top:10vh;position:absolute;margin-left:70vh">
    <div class="centertext">Политика конфиденциальности</div>
    </div>
    <div style="position: absolute; margin-top:20vh;margin-left:20vh;font-family: 'Comfortaa', sans-serif;
    font-size: 20px;word-wrap: break-word;width: 160vh;">
        Согласие на обработку персональных данных<br><br>
        Настоящим, при размещении (вводе) своих персональных данных на Интернет-сайте ООО «WordWide» https://word-wide.ru, пользователь дает свое согласие ООО «WordWide», находящемуся по адресу: г. Челябинск, ул. ​Воровского, 47, на обработку своих персональных данных для поддержания связи со мной любым способом, включая телефонные звонки на указанные номера телефонов, отправку смс-сообщений на указанные мобильные телефоны, отправку электронных писем на указанный адрес электронной почты с целью информирования о поступлении новых товаров/услуг, оповещения о проводимых акциях, мероприятиях, скидках, их результате, рассылки новостей, а также иной информации о товарах и услугах ООО «WordWide», в том числе рекламного содержания, а именно:<br><br>
        
        -Фамилия Имя Отчество;<br>
        -Номера контактных телефонов;<br>
        -Адреса электронной почты;<br>
        то есть на совершение действий, предусмотренных п. 3 ст. 3 Федерального закона от 27.07.2006 N152-ФЗ «О персональных данных»<br>
        
        <br>Подтверждаю, что все данные предоставляются мной добровольно.<br>
        Указанные персональные данные не относятся к общедоступным.<br>
        Согласие дается на обработку персональных данных, как без использования средств автоматизации, так и с их использованием.
        Основанием для обработки персональных данных является:<br>
        ст. 24 Конституции Российской Федерации;
        ст.6 Федерального закона №152-ФЗ «О персональных данных», иные федеральные законы и нормативные правовые акты.<br>
        
        <br>В ходе обработки с персональными данными будут совершены следующие действия: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передача (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение.<br>
        
        <br>Настоящее согласие действует со дня его подписания до дня отзыва в письменной форме. Согласие может быть отозвано в любой момент посредством направления письменного уведомления по адресу: 454092, г. Челябинск, OOO «WordWide»; направления электронного письма на электронный адрес: wordwide@study.com
        
    </div>   
    
    
</template>

<script>
    export default {
        data(){
            return{
                dialogVisible:false
            }
        },
    }
</script>

<style scoped>
.centertext{
    margin-top:5vh;
    text-align: center;
    font-family: 'Comfortaa', sans-serif;
    position:flex-end;
}
.footer{
    position:absolute;
    height:40vh;
    width: 100%!important;
    background-color: rgb(0, 0, 0);

  }
</style>