<template>
    <div>
        <div style="padding-top:10vh;">
        </div>
        <div v-if="this.result === 'A1'">
            <div class="centertext">
                Ваш Уровень - A1 <br><br>
                
            </div>
            <div class="text"> 
                Вы понимаете и можете говорить, используя знакомые выражения и очень простые фразы для решения конкретных задач в ситуациях повседневного общения: Вы можете объясниться в отеле, кафе, магазине, на улице, используя знакомые выражения и простые фразы для бытового общения. Умеете читать и переводить несложные тексты, можете писать простые письма (например, поздравление с праздником), заполнять формуляры. Вы понимаете медленную четкую речь, при условии, что тематика Вам знакома и близка. Но вам еще есть куда расти, поэтому мы предлагаем вам пройти Курс "Свободное Общение".
            </div>
        </div>

        <div v-if="this.result === 'A2'">
            <div class="centertext">
                Ваш Уровень - A2 <br><br>
                
            </div>
            <div class="text"> 
                Вы можете рассказывать о себе, своей семье, профессии, предпочтениях (в музыке, кухни, хобби, время года…). Понимаете, тексты рекламы, объявления в аэропорту, магазине, надписи на продуктах, открытках, знаете, как писать личные и деловые письма. Читать и пересказывать не очень сложные тексты. Но вам еще есть куда расти, поэтому мы предлагаем вам пройти Курс "Свободное Общение".
            </div>
        </div>

        <div v-if="this.result === 'B1'">
            <div class="centertext">
                Ваш Уровень - B1 <br><br>
                
            </div>
            <div class="text"> 
                Вы можете понимать, о чем идет речь в большинстве радио- и телепрограмм о текущих событиях. Знаете, как выразить собственное мнение, обосновывать свои взгляды, пересказывать содержание прочитанного или увиденного, вести личную и деловую переписку средней сложности, читать адаптированную литературу на иностранном языке. Но вам еще есть куда расти, поэтому мы предлагаем вам пройти Курс "Свободное Общение".
            </div>
        </div>

        <div v-if="this.result === 'B2'">
            <div class="centertext">
                Ваш Уровень - B2 <br><br>
                
            </div>
            <div class="text"> 
                Вы владеете разговорным языком в различных ситуациях (от бытовых до профессиональных), можете без подготовки общаться с носителем языка. Вы можете почти ясно и подробно высказаться по широкому кругу вопросов, объяснить свою точку зрения по важной проблеме, приводя аргументы за и против. Вы читаете неадаптированную литературу на иностранном языке, умеете пересказывать содержание сложных текстов. С таким уровнем владения английского языка, можно задумывать о карьере в англоговорящих странах, поэтому рекомендуем пройти Курс "Деловое Общение".
            </div>
        </div>

        <div v-if="this.result === 'C1'">
            <div class="centertext">
                Ваш Уровень - B2 <br><br>
                
            </div>
            <div class="text"> 
                Вы понимаете разнообразные сложные развернутые тексты и можете выявить содержащиеся в них имплицитные значения, умеете без подготовки, бегло, не испытывая трудности в подборе слов выражать свои мысли. Ваша речь отличается разнообразием языковых средств и точностью их употребления в ситуациях повседневного, учебного или профессионального общения. Вы умеете составлять четкие, логичные, подробные сообщения по сложной тематике.
            </div>
        </div>

        <div v-if="this.result === 'C2'">
            <div class="centertext">
                Ваш Уровень - C2 <br><br>
                
            </div>
            <div class="text"> 
                Вы свободно понимаете любую устную или письменную информацию, можете обобщить информацию, полученную из разных письменных или устных источников и представить ее в виде четко аргументированного связного сообщения. Вы умеете бегло и четко излагать свои мысли даже по сложным проблемам, передавая при этом тончайшие оттенки значения.
            </div>
        </div>
        
        <my-button @click='dialogVisible=true' class = "regformbutton">Записаться На Курс</my-button>
    </div>
    <div>
        
    </div>
    <my-dialog v-model:show="dialogVisible"></my-dialog>
</template>



<script>

    export default {
        data(){
            return{
                dialogVisible:false,
                result:localStorage.getItem('testresult')
            }
        },

    }
</script>

<style>
.centertext{
    margin-top:5vh;
    text-align: center;
    font-family: 'Comfortaa', sans-serif;
    position:flex-end;
    font-size: 2.5vh;
}
.text{
    padding-left: 45vh;
    padding-right: 45vh;
    text-align: justify;
    font-family: 'Comfortaa', sans-serif;
    position:flex-end;
    font-size: 2.5vh;
}
.regformbutton{
    background-color: aqua !important;
    padding: 10px 15px;
    letter-spacing: 0.0625em;
    width: 27%;
    height:auto;
    border-radius: 30px;
    border: 0px solid rgb(255, 255, 255);
    position: absolute;
    font-family: 'Comfortaa', sans-serif;
    color: rgb(0, 0, 0)!important;
    font-size: 23px;
    margin-left:72vh!important;
    margin-top:4vh !important;
    margin-bottom: 5vh;
    cursor:pointer;
    -webkit-text-stroke-width: 0.25px;
    -webkit-text-stroke-color: black!important;
  }
</style>